QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC17xx/vendor/lpc177x_8x_usbhost.c
    Host_DelayMS(50);                /* Wait 50 ms before apply reset              */
        
        LPC_USB->Control       = 0;    /* HARDWARE RESET  (HCFS = 00b)       */
    LPC_USB->ControlHeadED = 0;    /* Initialize Control list head to Zero       */
    LPC_USB->BulkHeadED    = 0;    /* Initialize Bulk list head to Zero          */
    
    /* SOFTWARE RESET                             */
    LPC_USB->CommandStatus = OR_CMD_STATUS_HCR;
    LPC_USB->FmInterval    = DEFAULT_FMINTERVAL;  /* Write Fm Interval and Largest Data Packet Counter */

                                                    /* Put HC in operational state                */
    LPC_USB->Control  = (LPC_USB->Control & (~OR_CONTROL_HCFS)) | OR_CONTROL_HC_OPER;
    LPC_USB->RhStatus = OR_RH_STATUS_LPSC;        /* Set Global Power                           */
    
    LPC_USB->HCCA = (uint32_t)Hcca;
    LPC_USB->InterruptStatus |= LPC_USB->InterruptStatus;                   /* Clear Interrrupt Status                    */

    LPC_USB->InterruptEnable  = OR_INTR_ENABLE_MIE |
                         OR_INTR_ENABLE_WDH |
                         OR_INTR_ENABLE_RHSC |
                         OR_INTR_ENABLE_UE;
}

/*********************************************************************//**
 * @brief                       Init host controller.
 * @param[in]           None.
 * @return              None.
 **********************************************************************/
void  Host_Init (void)
{

    LPC_SC->PCONP   |= 0x80000000;              /* Enable USB Interface */
        
    LPC_USB->OTGClkCtrl   = 0x00000019;  /* Enable USB host clock, OTG clock & AHB master clock         */
    while ((LPC_USB->OTGClkSt & 0x00000019) != 0x19);
        
        LPC_USB->StCtrl = 0x1;

#if _CURR_USING_BRD == _EA_PA_BOARD

        // Port U1
        PINSEL_ConfigPin(0,29,1);       /* USB_D+1      */
        PINSEL_ConfigPin(0,30,1);       /* USB_D-1      */
        
        PINSEL_ConfigPin(2,9,1);                /* USB_CONNECT1 */
        PINSEL_ConfigPin(1,18,1);               /* USB_UP_LED1  */

#if 0
        PINSEL_ConfigPin(1,19,1);           /* USB_TX_E1*/ 
        PINSEL_ConfigPin(1,22,1);           /* USB_RX_E1*/ 
    PINSEL_ConfigPin(1,20,1);           /* USB_TX_DP1 */
    PINSEL_ConfigPin(1,21,1);           /* USB_TX_DM1 */
    PINSEL_ConfigPin(1,23,1);           /* USB_RX_DP1 */
    PINSEL_ConfigPin(1,24,1);           /* USB_RX_DM1 */
#else
        PINSEL_ConfigPin(1,19,2);               /* USB_PPWR1    */
        PINSEL_ConfigPin(1,27,1);               /* USB_OVRCR1   */
#endif

        // Port U2
        PINSEL_ConfigPin(0,31,1);               /* USB_D+2      */
        PINSEL_ConfigPin(0,14,3);               /* USB_CONNECT2 */
        PINSEL_ConfigPin(0,13,1);               /* USB_UP_LED2  */

#if 1 /* Use USB Power Switch */
        PINSEL_ConfigPin(0,12,1);               /* USB_PPWR2    */
        PINSEL_ConfigPin(1,31,1);               /* USB_OVRCR2   */
#else 
        PINSEL_ConfigPin(1,30,2);               /* USB_VBUS     */
#endif

#else     /* _CURR_USING_BRD == _IAR_OLIMEX_BOARD */
        // Port U2
        PINSEL_ConfigPin(0,31,1);               /* USB_D+2      */
        PINSEL_ConfigPin(0,14,3);               /* USB_CONNECT2 */
        PINSEL_ConfigPin(0,13,1);               /* USB_UP_LED2  */

        PINSEL_ConfigPin(0,12,1);               /* USB_PPWR2    */
        PINSEL_ConfigPin(1,31,1);               /* USB_OVRCR2   */

#endif /* _CURR_USING_BRD == _EA_PA_BOARD */

    Host_CtrlInit();


    /* Enable the USB Interrupt */
        NVIC_EnableIRQ(USB_IRQn);               /* enable USB interrupt */
        NVIC_SetPriority (USB_IRQn, 0);                 /* highest priority */


}

/*********************************************************************//**
 * @brief                       services the interrupt caused by host controller.
 * @param[in]           None.
 * @return              None.
 **********************************************************************/
void  USB_IRQHandler (void)
{
    uint32_t   int_status;
    uint32_t   ie_status;

    int_status    = LPC_USB->InterruptStatus;                          /* Read Interrupt Status                */
    ie_status     = LPC_USB->InterruptEnable;                          /* Read Interrupt enable status         */
 
    if (!(int_status & ie_status)) {
        return;
    } else {

        int_status = int_status & ie_status;
        if (int_status & OR_INTR_STATUS_RHSC) {                 /* Root hub status change interrupt     */
            if (LPC_USB->RhPortStatus1 & OR_RH_PORT_CSC) {
                                if (LPC_USB->RhStatus & OR_RH_STATUS_DRWE) {
                                        /*
                                         * When DRWE is on, Connect Status Change
                                         * means a remote wakeup event.
                                        */
                                        HOST_RhscIntr |= 0x01;// JUST SOMETHING FOR A BREAKPOINT
                                }
                                else {
                                        /*
                                         * When DRWE is off, Connect Status Change
                                         * is NOT a remote wakeup event
                                        */
                                        if (LPC_USB->RhPortStatus1 & OR_RH_PORT_CCS) {
                                                        HOST_TDControlStatus = 0;
                                                        HOST_WdhIntr = 0;
                                                        HOST_RhscIntr |= 0x01;
                                                        gUSBConnected = 1;
                                        } else {
                                                        //LPC_USB->InterruptEnable = 0; // why do we get multiple disc. rupts???
                                                        HOST_RhscIntr &= ~0x01;
                                                        gUSBConnected = 0;
                                        }
                }
                LPC_USB->RhPortStatus1 = OR_RH_PORT_CSC;
            }
                        if (LPC_USB->RhPortStatus2 & OR_RH_PORT_CSC) {
                                if (LPC_USB->RhStatus & OR_RH_STATUS_DRWE) {
                                        /*
                                        * When DRWE is on, Connect Status Change
                                        * means a remote wakeup event.
                                        */
                                        HOST_RhscIntr |= 0x02;// JUST SOMETHING FOR A BREAKPOINT
                                }
                                else {
                                        /*
                                        * When DRWE is off, Connect Status Change
                                        * is NOT a remote wakeup event
                                        */
                                        if (LPC_USB->RhPortStatus2 & OR_RH_PORT_CCS) {
                                                        HOST_TDControlStatus = 0;
                                                        HOST_WdhIntr = 0;
                                                        HOST_RhscIntr |= 0x02;
                                                        gUSBConnected = 1;
                                        } else {
                                                        //LPC_USB->InterruptEnable = 0; // why do we get multiple disc. rupts???
                                                        HOST_RhscIntr &= ~0x02;
                                                        gUSBConnected = 0;
                                        }
                                }
                                LPC_USB->RhPortStatus2 = OR_RH_PORT_CSC;
                        }
                        if (LPC_USB->RhPortStatus1 & OR_RH_PORT_PRSC) {
                                LPC_USB->RhPortStatus1 = OR_RH_PORT_PRSC;
                        }
                        if (LPC_USB->RhPortStatus2 & OR_RH_PORT_PRSC) {
                                LPC_USB->RhPortStatus2 = OR_RH_PORT_PRSC;
                        }
                }
        if (int_status & OR_INTR_STATUS_WDH) {                  /* Writeback Done Head interrupt        */
            HOST_WdhIntr = 1;
                        HOST_TDControlStatus = (TDHead->Control >> 28) & 0xf;
        }
                if (int_status & OR_INTR_STATUS_UE) {                   /* Unrecoverable Error interrupt        */
                        UnrecoverableIntCount++;
        }    

        LPC_USB->InterruptStatus = int_status;                         /* Clear interrupt status register      */
    }           
    return;
}

/*********************************************************************//**
 * @brief                       enumerate the device connected.
 * @param[in]           None.
 * @return              None.
 **********************************************************************/
int32_t  Host_EnumDev (void)
{
    int32_t  rc;

    while (!gUSBConnected);
    Host_DelayMS(100);                             /* USB 2.0 spec says atleast 50ms delay beore port reset */
        
