QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC17xx/vendor/lpc177x_8x_usbhost.c
    if (ed == EDCtrl) {
        if (token == TD_SETUP) {
            td_toggle = TD_TOGGLE_0;
        } else {
            td_toggle = TD_TOGGLE_1;
        }
    } else {
        td_toggle = 0;
    }
    TDHead->Control = (TD_ROUNDING    |
                      token           |
                      TD_DELAY_INT(0) |                           
                      td_toggle       |
                      TD_CC);
    TDTail->Control = 0;
    TDHead->CurrBufPtr   = (uint32_t) buffer;
    TDTail->CurrBufPtr   = 0;
    TDHead->Next         = (uint32_t) TDTail;
    TDTail->Next         = 0;
    TDHead->BufEnd       = (uint32_t)(buffer + (buffer_len - 1));
    TDTail->BufEnd       = 0;

    ed->HeadTd  = (uint32_t)TDHead | ((ed->HeadTd) & 0x00000002);
    ed->TailTd  = (uint32_t)TDTail;
    ed->Next    = 0;

    if (ed == EDCtrl) {
        LPC_USB->ControlHeadED  = (uint32_t)ed;
        LPC_USB->CommandStatus |= OR_CMD_STATUS_CLF;
        LPC_USB->Control       |= OR_CONTROL_CLE;
    } else {
        LPC_USB->BulkHeadED     = (uint32_t)ed;
        LPC_USB->CommandStatus |= OR_CMD_STATUS_BLF;
        LPC_USB->Control       |= OR_CONTROL_BLE;
    }    

    Host_WDHWait();

//    if (!(TDHead->Control & 0xF0000000)) {
        if (!HOST_TDControlStatus) {
        return (USB_HOST_FUNC_OK);
    } else {      
        return (ERR_TD_FAIL);
    }
}
   
/*********************************************************************//**
 * @brief                       receive the control information.
 * @param[in]           bm_request_type.
 * @param[in]            b_request
 * @param[in]            w_value
 * @param[in]           w_index
 * @param[in]           w_length
 * @param[in]           buffer
 * @return              USB_HOST_FUNC_OK       if Success
 *                          ERROR    if Failed
 **********************************************************************/
int32_t  Host_CtrlRecv (         uint8_t   bm_request_type,
                                    uint8_t   b_request,
                                    uint16_t   w_value,
                                    uint16_t   w_index,
                                    uint16_t   w_length,
                          volatile  uint8_t  *buffer)
{
    int32_t  rc;


    Host_FillSetup(bm_request_type, b_request, w_value, w_index, w_length);
    rc = Host_ProcessTD(EDCtrl, TD_SETUP, TDBuffer, 8);
    if (rc == USB_HOST_FUNC_OK) {
        if (w_length) {
            rc = Host_ProcessTD(EDCtrl, TD_IN, buffer, w_length);
        }
        if (rc == USB_HOST_FUNC_OK) {
            rc = Host_ProcessTD(EDCtrl, TD_OUT, NULL, 0);
        }
    }
    return (rc);
}

/*********************************************************************//**
 * @brief                       send the control information.
 * @param[in]           bm_request_type.
 * @param[in]            b_request
 * @param[in]            w_value
 * @param[in]           w_index
 * @param[in]           w_length
 * @param[in]           buffer
 * @return              USB_HOST_FUNC_OK       if Success
 *                          ERROR    if Failed
 **********************************************************************/
int32_t  Host_CtrlSend (          uint8_t   bm_request_type,
                                     uint8_t   b_request,
                                     uint16_t   w_value,
                                     uint16_t   w_index,
                                     uint16_t   w_length,
                           volatile  uint8_t  *buffer)
{
    int32_t  rc;

    Host_FillSetup(bm_request_type, b_request, w_value, w_index, w_length);

    rc = Host_ProcessTD(EDCtrl, TD_SETUP, TDBuffer, 8);
    if (rc == USB_HOST_FUNC_OK) {
        if (w_length) {
            rc = Host_ProcessTD(EDCtrl, TD_OUT, buffer, w_length);
        }
        if (rc == USB_HOST_FUNC_OK) {
            rc = Host_ProcessTD(EDCtrl, TD_IN, NULL, 0);
        }
    }
    return (rc);
}

/*********************************************************************//**
 * @brief                       fill the setup packet.
 * @param[in]           None.
 * @return              USB_HOST_FUNC_OK       if Success
 *                          ERROR    if Failed
 **********************************************************************/
void  Host_FillSetup (uint8_t   bm_request_type,
                      uint8_t   b_request,
                      uint16_t   w_value,
                      uint16_t   w_index,
                      uint16_t   w_length)
{
        int i;
        for (i=0;i<w_length;i++)
                TDBuffer[i] = 0;
        
    TDBuffer[0] = bm_request_type;
    TDBuffer[1] = b_request;
    WriteLE16U(&TDBuffer[2], w_value);
    WriteLE16U(&TDBuffer[4], w_index);
    WriteLE16U(&TDBuffer[6], w_length);
}

/*********************************************************************//**
 * @brief                       initializes transfer descriptor.
 * @param[in]           td       Pointer to TD structure.
 * @return              None.
 **********************************************************************/
void  Host_TDInit (volatile  HCTD *td)
{

    td->Control    = 0;
    td->CurrBufPtr = 0;
    td->Next       = 0;
    td->BufEnd     = 0;
}


/*********************************************************************//**
 * @brief                       initializes endpoint descriptor.
 * @param[in]           td       Pointer to ED structure.
 * @return              None.
 **********************************************************************/
void  Host_EDInit (volatile  HCED *ed)
{

    ed->Control = 0;
    ed->TailTd  = 0;
    ed->HeadTd  = 0;
    ed->Next    = 0;
}

/*********************************************************************//**
 * @brief                       initializes host controller communications area.
 * @param[in]           hcca       Pointer to HCCA.
 * @return              None.
 **********************************************************************/
void  Host_HCCAInit (volatile  HCCA  *hcca)
{
    uint32_t  i;

    for (i = 0; i < 32; i++) {

        hcca->IntTable[i] = 0;
        hcca->FrameNumber = 0;
        hcca->DoneHead    = 0;
    }

