QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/framework/source/platform/hal/nxp/mcu/LPC17xx/vendor/lpc177x_8x_usbhost.c
}


/*********************************************************************//**
 * @brief                       infinite loop which breaks when ever a WDH interrupt rises.
 * @param[in]           None.
 * @return              None.
 **********************************************************************/
void  Host_WDHWait (void)
{
  while (!HOST_WdhIntr) {
    ;
  }
  HOST_WdhIntr = 0;
}


/*********************************************************************//**
 * @brief                       read an unsigned integer from a charecter buffer in the platform
 *              containing little endian processor.
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @return              val     Unsigned integer.
 **********************************************************************/
uint32_t  ReadLE32U (volatile  uint8_t  *pmem)
{
    uint32_t   val;

    ((uint8_t *)&val)[0] = pmem[0];
    ((uint8_t *)&val)[1] = pmem[1];
    ((uint8_t *)&val)[2] = pmem[2];
    ((uint8_t *)&val)[3] = pmem[3];
    return (val);
}


/*********************************************************************//**
 * @brief                       write an unsigned integer into a charecter buffer in the platform 
 *              containing little endian processor.
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @param[in]           val     Integer value to be placed in the charecter buffer
 * @return              None.
 **********************************************************************/
 void  WriteLE32U (volatile  uint8_t  *pmem,
                            uint32_t   val)
{
    pmem[0] = ((uint8_t *)&val)[0];
    pmem[1] = ((uint8_t *)&val)[1];
    pmem[2] = ((uint8_t *)&val)[2];
    pmem[3] = ((uint8_t *)&val)[3];
}


/*********************************************************************//**
 * @brief                       read an unsigned short integer from a charecter buffer in the platform
*              containing little endian processor.
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @return              val     Unsigned short integer.
 **********************************************************************/
uint16_t  ReadLE16U (volatile  uint8_t  *pmem)
{
    uint16_t   val;

    ((uint8_t *)&val)[0] = pmem[0];
    ((uint8_t *)&val)[1] = pmem[1];
    return (val);
}

/*********************************************************************//**
 * @brief                       write an unsigned short integer into a charecter buffer in the
 *              platform containing little endian processor.
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @param[in]          val     Value to be placed in the charecter buffer
 * @return              None.
 **********************************************************************/
void  WriteLE16U (volatile  uint8_t  *pmem,
                            uint16_t   val)
{
    pmem[0] = ((uint8_t *)&val)[0];
    pmem[1] = ((uint8_t *)&val)[1];
}

/*
**************************************************************************************************************
*                                         READ BE 32U
*
* Description: This function is used to read an unsigned integer from a charecter buffer in the platform
*              containing big endian processor
*
* Arguments  : pmem    Pointer to the charecter buffer
*
* Returns    : val     Unsigned integer
*
**************************************************************************************************************
*/

/*********************************************************************//**
 * @brief                       read an unsigned integer from a charecter buffer in the platform
 *              containing big endian processor.
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @return              val     Unsigned integer.
 **********************************************************************/
uint32_t  ReadBE32U (volatile  uint8_t  *pmem)
{
    uint32_t   val;

    ((uint8_t *)&val)[0] = pmem[3];
    ((uint8_t *)&val)[1] = pmem[2];
    ((uint8_t *)&val)[2] = pmem[1];
    ((uint8_t *)&val)[3] = pmem[0];
    return (val);
}

/*********************************************************************//**
 * @brief                       write an unsigned integer into a charecter buffer in the platform
 *              containing big endian processor
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @param[in]          val     Value to be placed in the charecter buffer       
 * @return              None.
 **********************************************************************/
void  WriteBE32U (volatile  uint8_t  *pmem,
                            uint32_t   val)
{
    pmem[0] = ((uint8_t *)&val)[3];
    pmem[1] = ((uint8_t *)&val)[2];
    pmem[2] = ((uint8_t *)&val)[1];
    pmem[3] = ((uint8_t *)&val)[0];
}

/*********************************************************************//**
 * @brief                       read an unsigned short integer from a charecter buffer in the platform
*              containing big endian processor
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @return              val     Unsigned short integer.
 **********************************************************************/
 uint16_t  ReadBE16U (volatile  uint8_t  *pmem)
{
    uint16_t  val;

    ((uint8_t *)&val)[0] = pmem[1];
    ((uint8_t *)&val)[1] = pmem[0];
    return (val);
}

/*********************************************************************//**
 * @brief                       write an unsigned short integer into the charecter buffer in the
 *              platform containing big endian processor.
 * @param[in]           pmem    Pointer to the charecter buffer.
 * @param[in]            val     Value to be placed in the charecter buffer
 * @return              None.
 **********************************************************************/
 void  WriteBE16U (volatile  uint8_t  *pmem,
                            uint16_t   val)
{
    pmem[0] = ((uint8_t *)&val)[1];
    pmem[1] = ((uint8_t *)&val)[0];
}

/**
* @}
*/

